[
  {
    "name" : "Snowflake Generator",
    "link" : "snowflakeGenerator/index.html",
    "desc" : "Repeatedly grow a random snowflake until it reaches full size and then begin again."
  },
  {
    "name" : "Maurer Rose",
    "link" : "MaurerRose/index.html",
    "desc" : "A set of points along rose curve connected with straight lines. Animated so that the set of points and number of rose petals changes over time."
  },
  {
    "name" : "Ray Casting",
    "link" : "RayCasting/index.html",
    "desc" : "A movable light source emitting rays in all directions. The rays end when they hit a wall."
  },
  {
    "name" : "Modulo Times Table Circle",
    "link" : "timesTablesCirclePattern/index.html",
    "desc" : "A cicle with numbers 0 to N-1 around the outside. Each number is then multiplied by a factor F modulo N, and a line is drawn from it to the result. The multiplication factor is increased as time goes on."
  },
  {
    "name" : "Lissajous Curve Table",
    "link" : "LissajousCurveTable/index.html",
    "desc" : "A table with rotating cogs in the top row and left column. The speed of the cogs increases going right/down along the table. Horizontal and vertical lines are then drawn from a point on the cogs edge. Where these lines intersect a path is traced."
  },
  {
    "name" : "Matrix Rain",
    "link" : "matrixRain/index.html",
    "desc" : "The falling streams of symbols seen in the Matrix films."
  },
  {
    "name" : "Cicle Filling Images",
    "link" : "circleFilling/index.html",
    "desc" : "Abstractly draw a linked image using expanding circles. Repeatedly spawn growing circles on the screen that stop growing when they touch another circle. Each circle's colour is relative to the linked image."
  },
  {
    "name" : "Chaos Game",
    "link" : "chaosGame/index.html",
    "desc" : "Place a series of N points, 3 points in this example. Draw a dot at a random place on the screen. Randomly chose a point and move the dot halfway to it, and then repeat forever. Depending on the number of points, different patterns will appear."
  },
  {
    "name" : "Purple Rain",
    "link" : "purpleRain/index.html",
    "desc" : "My first project using p5. A simple rain simulation coloured purple, in reference to Prince."
  }
]
